# DataFrame에서 데이터 추출-----------------

- 열(column 세로벡터) 단위 데이터 추출 ★대괄호 -> 열
    - 방식 : DF객체변수명[컬러명] 또는 DF객체변수명.컬럼명
    
- 행(row 가로벡터) 단위 데이터 추출    ★loc -> 행 포함될 시
    - 방식 : DF객체변수명.loc[인덱스라벨] 또는 DF객체변수명.iloc[정수 인덱스]
    

- 원소 단위 데이터 추출
    - 방식 : DF객체변수명.loc[행인데스라벨, 열인덱스라벨] 또는 [행인덱스][열인덱스]
    - 방식 : DF객체변수명.iloc[행인데스라벨, 열인덱스라벨] 또는 [행인덱스][열인덱스]

In [84]:
# 모듈 로딩 -------------------------------------------------
import pandas as pd
datas=[[1,2,3],[11,22,33]]
# DF객체 생성-------------------------------------------------
df=pd.DataFrame(datas)
# DF객체 요약 정보 출력 메서드
df

    0   1   2
0   1   2   3
1  11  22  33

# 열(세로) 데이터 추출------------------

In [8]:
# DF객체변수명[컬럼명]
oneCol=df[0]

print(f'oneCol => \n{oneCol}',f'oneCol Type=> {type(oneCol)}', sep='\n')

oneCol =>
0     1
1    11
Name: 0, dtype: int64
oneCol Type=> <class 'pandas.core.series.Series'>

In [11]:
twoCol=df[0:2] #★column문자열 인덱스로는 추출안됨.

print(f'twoCol => \n{twoCol}',f'twoCol Type=> {type(twoCol)}', sep='\n')

twoCol =>
    0   1   2
0   1   2   3
1  11  22  33
twoCol Type=> <class 'pandas.core.frame.DataFrame'>

In [14]:
# DF객체의 column 속성변경  
df.columns=['one','two','three']
df.info

<bound method DataFrame.info of    one  two  three
0    1    2      3
1   11   22     33>

# 행(row, 가로) 데이터 추출-------------
- DF객체변수명.LOC[], DF객체변수명.iloc[]

In [120]:
# DF객체 데이터 확인
df[1]

0     2
1    22
Name: 1, dtype: int64

In [20]:
# 11, 22, 33 라인 전체 추출 #세로(열)
df['one']

0     1
1    11
Name: one, dtype: int64

In [19]:
# 11, 22, 33 라인 전체 추출 #가로(행) iloc
df.iloc[1]

one      11
two      22
three    33
Name: 1, dtype: int64

In [24]:
# 11, 22, 33 라인 전체 추출
oneRow=df.iloc[1]

print(f'oneRow => \n{oneRow}', f'oneRow Type=> {type(oneRow)}', sep='\n')

oneRow =>
one      11
two      22
three    33
Name: 1, dtype: int64
oneRow Type=> <class 'pandas.core.series.Series'>

In [25]:
# 11, 22, 33 라인 전체 추출
oneRow=df.loc[1]

print(f'oneRow => \n{oneRow}', f'oneRow Type=> {type(oneRow)}', sep='\n')

oneRow =>
one      11
two      22
three    33
Name: 1, dtype: int64
oneRow Type=> <class 'pandas.core.series.Series'>

In [32]:
twoRow=df.iloc[[0,1]] # 하나의 인덱스->시리즈, 두개이상->데이터프레임

print(f'twoRow => \n{twoRow}', f'twoRow Type=> {type(twoRow)}', sep='\n')

twoRow =>
3
twoRow Type=> <class 'numpy.int64'>

# 예제 실습------------------------------------

In [34]:
exam_data={'수학':[90,80,70],'영어':[98,20,72],'음악':[93,30,20],'체육':[30,50,60]}

In [40]:
df2 = pd.DataFrame(exam_data, index=['서준','우현','인아'])

In [45]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 서준 to 인아
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 228.0+ bytes

NameError: name 'columns' is not defined

In [47]:
# 우현 학생의 성적만 추출-------
df2.loc["우현"]

수학    80
영어    20
음악    30
체육    50
Name: 우현, dtype: int64

In [49]:
df2.iloc[1]

수학    80
영어    20
음악    30
체육    50
Name: 우현, dtype: int64

In [50]:
# 인아 학생의 성적만 추출-------
df2.loc["인아"]

수학    70
영어    72
음악    20
체육    60
Name: 인아, dtype: int64

In [51]:
df2.iloc[2]

수학    70
영어    72
음악    20
체육    60
Name: 인아, dtype: int64

In [56]:
# 음악 성적만 추출-------
oneCol=df2.음악         # 열 하나면 괄호없이(.열이름) 가능
oneCol

서준    93
우현    30
인아    20
Name: 음악, dtype: int64

In [60]:
oneCol=df2["음악"]
oneCol

서준    93
우현    30
인아    20
Name: 음악, dtype: int64

In [64]:
# 우현학생의 음악 점수만 추출
df2

    수학  영어  음악  체육
서준  90  98  93  30
우현  80  20  30  50
인아  70  72  20  60

In [72]:
# DF에서 원소 추출 => iloc[ 행, 열] 또는 loc[행,열]
woo=df2.loc['우현','음악']
print(f'result=>{woo},type =>{type(woo)}', sep='\n')

result=>30,type =><class 'numpy.int64'>

In [75]:
woo=df2.loc['우현']['음악']
print(f'result=>{woo},type =>{type(woo)}', sep='\n')

result=>30,type =><class 'numpy.int64'>

In [74]:
woo=df2.iloc[1,2]
print(f'result=>{woo},type =>{type(woo)}', sep='\n')

result=>30,type =><class 'numpy.int64'>

In [76]:
woo=df2.iloc[1][2]
print(f'result=>{woo},type =>{type(woo)}', sep='\n')

result=>30,type =><class 'numpy.int64'>

In [82]:
select=df2["수학"][2]
select

70

# DF에 행과 열 추가하기-----------------------

- 행 추가 => DF객체변수명.loc[행라벨] = 데이터

- 열 추가 => DF객체변수명.[컬럼] = 데이터

In [85]:
# DF 데이터 확인
df2

    수학  영어  음악  체육
서준  90  98  93  30
우현  80  20  30  50
인아  70  72  20  60

In [86]:
# 행(row) 추가하기------------------------------------
df2.loc['혜진']=[100,100,100,100]
df2

     수학   영어   음악   체육
서준   90   98   93   30
우현   80   20   30   50
인아   70   72   20   60
혜진  100  100  100  100

In [91]:
df2.loc['나령']=100   # [대 괄호 없이 사용 가능 경우]
df2                   # -> 각 컬럼의 값이 같을 때

     수학   영어   음악   체육
서준   90   98   93   30
우현   80   20   30   50
인아   70   72   20   60
혜진  100  100  100  100
나령  100  100  100  100

In [93]:
# 열(컬럼 column) 추가하기 ------------------------------
df2['국어']=[100,100,100,100,100]
df2

     수학   영어   음악   체육   국어
서준   90   98   93   30  100
우현   80   20   30   50  100
인아   70   72   20   60  100
혜진  100  100  100  100  100
나령  100  100  100  100  100

In [97]:
df2['체육']=90
df2

     수학   영어   음악  체육  국어
서준   90   98   93  90  90
우현   80   20   30  90  90
인아   70   72   20  90  90
혜진  100  100  100  90  90
나령  100  100  100  90  90

# DF에서 행과 열 삭제하기--------------------

- 삭제 관련 메서드 => drop(헹) -> axis=0 : 행 기본값.
    - 행 삭제 : DF객체변수명.drop(행, axis=0) 
    - 열 삭제 : DF객체변수명.drio(열, axis=1)

- drop() 특징
    - 실제 데이터 삭제하지 않음 => 복사본에서 데이터 삭제하고 복사본 반환
    - 셀제 데이터 삭제하기 => inplace = True

In [99]:
df2

     수학   영어   음악  체육  국어
서준   90   98   93  90  90
우현   80   20   30  90  90
인아   70   72   20  90  90
혜진  100  100  100  90  90
나령  100  100  100  90  90

In [100]:
# 인하 학생 성적 제거 ---> 행(row)
df2.drop('인아')

     수학   영어   음악  체육  국어
서준   90   98   93  90  90
우현   80   20   30  90  90
혜진  100  100  100  90  90
나령  100  100  100  90  90

In [101]:
df2 # 인아가 아직 있네?

     수학   영어   음악  체육  국어
서준   90   98   93  90  90
우현   80   20   30  90  90
인아   70   72   20  90  90
혜진  100  100  100  90  90
나령  100  100  100  90  90

In [103]:
df3=df2.drop('인아')
df3

     수학   영어   음악  체육  국어
서준   90   98   93  90  90
우현   80   20   30  90  90
혜진  100  100  100  90  90
나령  100  100  100  90  90

In [108]:
# 원본에서 삭제
df4=df2.drop('서준',inplace= True)
print(df4)

KeyError: "['서준'] not found in axis"

In [107]:
df2

     수학   영어   음악  체육  국어
우현   80   20   30  90  90
인아   70   72   20  90  90
혜진  100  100  100  90  90
나령  100  100  100  90  90

In [110]:
# 열 삭제 => 수학 컬럼
df5= df2.drop('수학',axis=1)
df5

     영어   음악  체육  국어
우현   20   30  90  90
인아   72   20  90  90
혜진  100  100  90  90
나령  100  100  90  90

In [111]:
df2

     수학   영어   음악  체육  국어
우현   80   20   30  90  90
인아   70   72   20  90  90
혜진  100  100  100  90  90
나령  100  100  100  90  90

# 행 & 열 전환 -----------------------------------

- 행 ==> 열, 열 ==> 행 으로 변환

- 방법
    - 메서드 : DF객체변수명.transpose()
    - 속성 : DF객체변수명. T

In [112]:
# DF 객체의 형태 => shape속성
df2.shape

(4, 5)

In [113]:
# 행<->열 전환
df2.T

    우현  인아   혜진   나령
수학  80  70  100  100
영어  20  72  100  100
음악  30  20  100  100
체육  90  90   90   90
국어  90  90   90   90

In [115]:
df2.shape # ---> 원본은 바뀌지 않음

(4, 5)

In [116]:
df2.transpose()

    우현  인아   혜진   나령
수학  80  70  100  100
영어  20  72  100  100
음악  30  20  100  100
체육  90  90   90   90
국어  90  90   90   90

In [117]:
df2

     수학   영어   음악  체육  국어
우현   80   20   30  90  90
인아   70   72   20  90  90
혜진  100  100  100  90  90
나령  100  100  100  90  90

In [118]:
df2=df2.transpose()         # 변경상태 저장
df2.shape

(5, 4)